<!-- <pre> -->
<?php
/*
------------------------------------------------
|    日期    |   金额（元）  |       备注        |
------------------------------------------------
| 2018-06-01 |    -32.5     |      吃饭消费     |
| 2018-06-02 |      +80     |     兼职发传单     |
| 2018-06-10 |      -25     |    购买考研书籍    |
| 2018-06-11 |     -115.5   |    给女朋友买礼物  |
| 2018-06-12 |     +10      |   悟空问题答题红包 |
| 2018-06-13 |      -25     |   购买零食        |
| 2018-06-14 |    -32.5     |    购买无线网卡   |
| 2018-06-15 |    +80       |  投稿赚钱         |
| 2018-07-02 |      -25     |     生活消费      |
| 2018-07-05 |      -200    |    朋友生日红包   |
| 2018-08-02 |     +80      |        发传单     |
| 2018-08-06 |      -25     |       网吧打游戏  |
------------------------------------------------
*/

$billdata = [
    [
        'date' => '2018-06-01',
        'money' => -32.5,
        'comment' => '吃饭消费',
    ],
    [
        'date' => '2018-06-02',
        'money' => 80,
        'comment' => '兼职发传单',
    ],
    [
        'date' => '2018-06-10',
        'money' => -25,
        'comment' => '购买考研书籍',
    ],
    [
        'date' => '2018-06-11',
        'money' => -115.5,
        'comment' => '给女朋友买礼物',
    ],
    [
        'date' => '2018-06-12',
        'money' => 10,
        'comment' => '悟空问题答题红包',
    ],
    [
        'date' => '2018-06-13',
        'money' => -25,
        'comment' => '购买零食',
    ],
    [
        'date' => '2018-06-14',
        'money' => -32.5,
        'comment' => '购买无线网卡',
    ],
    [
        'date' => '2018-06-15',
        'money' => 80,
        'comment' => '投稿赚钱',
    ],
    [
        'date' => '2018-07-02',
        'money' => -25,
        'comment' => '生活消费',
    ],
    [
        'date' => '2018-07-05',
        'money' => -200,
        'comment' => '朋友生日红包',
    ],
    [
        'date' => '2018-08-02',
        'money' => 80,
        'comment' => '发传单',
    ],
    [
        'date' => '2018-08-06',
        'money' => -25,
        'comment' => '网吧打游戏',
    ],
];

// var_dump($billdata);
// ?>
<!-- </pre> -->